var containerEl = document.querySelector("#portfolio");
var mixer = mixitup(containerEl, {
    selectors: {
        target: '.mix'
    },
    animation: {
        duration: 300
    }
});
var menu = {
    breakfast1 : {
        title: "Сирний суп",
        price: 70,
        description: "Ніжний сирний смак супу здатний розтопити серця навіть найбільш сильних супротивників перших страв. Його аромат і незвичайний вершковий вигляд привертає увагу на столі і викликає сильний апетит. Крім того, досить ситний суп, тому підійде на сніданок та обід, як сильній половині людства, так і для самих маленьких."
    },
    breakfast2 : {
        title: "Стейк з лосося",
        price: 65,
        description: "М'ясо лосося, настільки соковите, поживна і багата життєво необхідними амінокислотами приготоване на грилі. Здавалося б нічого хитрого, все що необхідно це стейк, сіль, перець і ... гриль. Але спробувавши перший шматочок, можете бути впевнені, ми зустрінемося з Вами на наступний день все з того ж приводу! Стейк подається политий спеціально приготованим гарячим соусом з з вершків, спецій і дрібно рубаного кропу."
    },
    breakfast3 :{
        title: "Суп «Нудл з морепродуктами»",
        price: 88,
        description: "Це смачне, ситне, а також корисну страву, зроблене з найсвіжіших продуктів, до складу якого входить: шпинат; мідії; кунжут; варене яйце; локшина; гриби шиітаке; курячий бульйон; креветки. Вага страви становить 450 гр."
    },
    breakfast4 :{
        title: "Рис з морепродуктами",
        price: 91,
        description: "Один з найсмачніших варіантів - Рис з морепродуктами. Блюдо, в складі якого: морква; яйце; Мал; цибуля; морський коктейль; пекінська капуста; паростки сої. Ідеальний варіант для великої і галасливої компанії! Вага порції - 320 г."
    },
    breakfast5 :{
        title: "Ніжне м'ясо молодого теляти",
        price: 74,
        description: "Ніжне м'ясо молодого теляти, обсмажене з бамбуком і грибами.Бамбук вважається в Китаї королем овочів, у нього не тільки вишуканий смак, але також він вбирає запахи продуктів, з якими готується. Цікаво, що в їжу додають бамбукові паростки, які тільки пробиваються з-під землі."
    },
    breakfast6 :{
        title: "Крем-суп «Сирний з грибами»",
        price: 92,
        description: "Це ситне, смачне, а також корисну страву, зроблене зі свіжих продуктів, до складу якого входить: картопля; сир моцарелла; морква; ріпчасту цибулю, молоко, зелень, печериці. Вага страви - 300 г."
    },
    desert1 :{
        title: "Млинці шоколадні з сиром",
        price: 64,
        description: "Це смачна, ситна, а також корисна страва, приготована зі свіжих інгредієнтів, до складу якої входить:сирна маса;карамельний соус;фрукти. Вага страви складає 280 г."
    },
    desert2 :{
        title: "Торт Прага",
        price: 71,
        description: "Це ситне, смачне, а також корисну страву, приготовану з найсвіжіших продуктів. Вага страви становить 125 гр.Як це не дивно, цей торт походить не з міста Праги, з яким Львів колись був об’єднаний спільними кондитерськими та кулінарними традиціями,  а з Москви. 1955 року чеський кондитер кілька тижнів вчив робити шоколадний торт московських майстрів легендарного ресторану «Прага» на Арбаті. Серед них був і майбутній голова кондитерського цеху «Праги» 16-річний Владімір Ґуральнік. Він згодом і розробив класичний рецепт."
    },
    desert3 :{
        title: "Тірамісу",
        price: 69,
        description: "Це смачна, Ситна, а такоже корисна страва, пріготована зі найсвіжішіх інгредієнтів, до складу якої входить: сир маскарпоне; печиво Савоярді. Вага страви - 160 г."
    },
    desert4 :{
        title: "Млинці з малиною",
        price: 59,
        description: "Пропонуємо скуштувати традиційні українські «Млинці з малиною», які обов’язково прийдуться Вам до смаку! Поєднання запашного рум’яного тіста із соковитими солодкими ягодами, домашньою сметанкою чи супершоколадним соусом – справжній ШЕДЕВР! Це варто спробувати!"
    },
    desert5 :{
        title: "Торт Шварцвальдський",
        price: 68,
        description: "Вважається, що Шварцвальдський торт винайшов німецький кондитер Йозеф Келлер у знаменитому кафе Agner міста Бад Ґодесберґ 1915 року. Є інша версія, за якою авторство належить кондитеру Ервіну Гільденбранду з Тюбінґену. Так чи інакше, комбінація вишень, вершків та вишневої наливки була відома у Південному Шварцвальді ще у 19 столітті, щоправда не як торт, а як десерт. 1934 року рецепт вперше був опублікований, і торт швидко набув популярності. Він досі залишається одним з найвідоміших та найулюбленіших німецьких тортів."
    },
    desert6 :{
        title: "Торт Мазурок",
        price: 83,
        description: "Наш «Мазурок» — один із численних варіантів традиційного святкового торта, який у Польщі готують на Великодні свята. У нас ця дуже домашня випічка, рецепти якої мандрують поколіннями, від зошита до зошита,  ще й дуже розкішна: з курагою, горіхами, безе та ніжним масляним кремом."
    },
    special1 :{
        title: "Салат з язиком і руколою",
        price: 88,
        description: "Це смачне, ситне, а також корисну страву, зроблене з найсвіжіших інгредієнтів, до складу якого входить: перепелине яйце; томат черрі; гірчичний соус; корнішони; язик відварний; салат лолло роса; рукола. Вага страви становить 185 гр."
    },
    special2 :{
        title: "Салат з телятиною",
        price: 78,
        description: "Це смачне, ситне, а також корисну страву, зроблене з найсвіжіших продуктів, до складу якого входить: спаржа; кукурудза; телятина; салат айсберг; гірчичний соус; перець. Вага страви - 200 гр."
    },
    special3 :{
        title: "Салат «Грецький»",
        price: 66,
        description: "Овочі є найбільш необхідною та невід'ємною частиною в раціоні харчування людини. Безцінна користь овочів укладена в великому вмісті в них вітамінів. А в поєднанні з грецьким сиром фета і натурального оливкового масла крупно нарізані овочі особливо соковиті і апетитні."
    },
    special4 :{
        title: "Салат «Містер Цезар з куркою»",
        price: 92,
        description: "Найпопулярніший вид цього салату, який має тисячі варіацій. Звичайно, кожна з них має право на існування, але що не говори, «Цезар» з куркою, приготований кухарями «Mister Alexander» за оригінальним рецептом, є справжнім райською насолодою!"
    },
    special5 :{
        title: "Салат «Аджапсандал»",
        price: 77,
        description: "Салат, який відрізняється не тільки відмінним смаком, але ще і корисними властивостями. У ньому містяться овочі, які повні вітамінів. Можна поїсти смачно і з користю."
    },
    special6 :{
        title: "Салат «Мідорі сарада»",
        price: 75,
        description: "Це ситне, смачне, а також корисну страву, приготовану з найсвіжіших продуктів, до складу якого входить: томат; спеції; солодкий перець; огірок; салат лолло роса. Вага страви становить 170 гр."
    },
    dinner1 :{
        title: "Бургер з куркою",
        price: 128,
        description: "Це смачне, ситне, а також корисну страву, приготовану з натуральних продуктів, до складу якого входить: томат; бекон; салат айсберг; соус Цезар; булочка для бургера; куряче філе гриль; сир парміджано ріджано. Вага страви - 280 гр."
    },
    dinner2 :{
        title: "Стейк з сьомги «Кінір Сяке»",
        price: 118,
        description: "Це смачне, ситне, а також корисну страву, приготовану з натуральних продуктів, до складу якого входить: гостро-солодкий соус; сьомга; овочі; міні-картопля. Вага страви - 110 гр."
    },
    dinner3 :{
        title: "Салат «НудлЦезарь з куркою»",
        price: 148,
        description: "Це смачне, ситне, а також корисну страву, приготовану з натуральних інгредієнтів, до складу якого входить: мікс салатів; томат; сир пармезан; соус Цезар; варене яйце; крутон; куряче м'ясо. Вага страви - 330 гр."
    },
    dinner4 :{
        title: "Паста «Карбонара»",
        price: 155,
        description: "Це ситне, смачне, а також корисну страву, приготовану з свіжих продуктів, до складу якого входить: бекон; сир пармезан; вершковий соус; цибуля. Вага страви - 260 гр."
    },
    dinner5 :{
        title: "Стейк з лосося «Тартар»",
        price: 161,
        description: "Це ситне, смачне, а також корисну страву, зроблене з найсвіжіших інгредієнтів, до складу якого входить: лосось; соус Таратор. Вага страви - 100 г."
    },
    dinner6 :{
        title: "Стейк «Порк»",
        price: 134,
        description: "Це смачне, ситне, а також корисну страву, зроблене з найсвіжіших інгредієнтів, до складу якого входить: свинина; овочі; соус Барбекю. Вага страви становить 300 гр."
    },
    dinner7 :{
        title: "Стейк з сьомги зі шпинатом",
        price: 99,
        description: "Стейк зі шпинатним пюре під тайським медово-вершковим соусом. Це смачне, ситне, а також корисну страву, приготовану з найсвіжіших продуктів."
    },
}

function showOneCard(e) {
    console.dir(document.getElementById('animatedModal').children)
    var childModal = document.getElementById('animatedModal');
    if(childModal.children.length != 0){
        childModal.innerHTML = "";
    }
    var elemImg = e.toElement.parentElement.dataset.idcardmenu;
    console.dir(e.toElement.parentElement.dataset.idcardmenu);
    var div = document.createElement('div');
    div.innerHTML = `
            <img class="img-responsive" src="images/${elemImg}.jpg">
            <p class="modal-menu-title pacifico">${menu[elemImg].title}</p>
            <p class="modal-menu-description">${menu[elemImg].description}</p>
            <p class="modal-menu-price pacifico">Ціна: ${menu[elemImg].price} &#8372</p>
            <button type="button" class="btn-order btn btn-warning">Замовити</button>`;
    document.getElementById('animatedModal').appendChild(div);
}
var menuAll = document.querySelectorAll('.mix');
for (let i = 0; i < menuAll.length; i++) {
    menuAll[i].addEventListener('click', showOneCard); 
}

$(document).click(function (event) {
    var clickover = $(event.target);
    var $navbar = $(".navbar-collapse");               
    var _opened = $navbar.hasClass("in");
    if (_opened === true && !clickover.hasClass("navbar-toggle")) {      
        $navbar.collapse('hide');
    }
});